LokeLunarius/MCU_LAB_231/Lab_1/Lab1_STM32/Lab1_Ex6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define clk_I_Pin GPIO_PIN_4
#define clk_I_GPIO_Port GPIOA
#define clk_II_Pin GPIO_PIN_5
#define clk_II_GPIO_Port GPIOA
#define clk_III_Pin GPIO_PIN_6
#define clk_III_GPIO_Port GPIOA
#define clk_IV_Pin GPIO_PIN_7
#define clk_IV_GPIO_Port GPIOA
#define clk_V_Pin GPIO_PIN_8
#define clk_V_GPIO_Port GPIOA
#define clk_VI_Pin GPIO_PIN_9
#define clk_VI_GPIO_Port GPIOA
#define clk_VII_Pin GPIO_PIN_10
#define clk_VII_GPIO_Port GPIOA
#define clk_VIII_Pin GPIO_PIN_11
#define clk_VIII_GPIO_Port GPIOA
#define clk_IX_Pin GPIO_PIN_12
#define clk_IX_GPIO_Port GPIOA
#define clk_X_Pin GPIO_PIN_13
#define clk_X_GPIO_Port GPIOA
#define clk_XI_Pin GPIO_PIN_14
#define clk_XI_GPIO_Port GPIOA
#define clk_XII_Pin GPIO_PIN_15
#define clk_XII_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
